Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Tales of Sarimin The Jinn.tmx
Source language: id
Languages: en

source: KENYATAANNYA..
en: it is the truth...

source: TINGGALIN DULU KERJAAN-NYA NAPA, SIH?!
en: stop working right now!

source: NGEENGG
en: vroom

source: TAHU, LAH..
en: his job...

source: BELUM MEMAKAN
en: none had suffered

source: UWAAAA!!
en: waaa!

source: SARIMINNIEE!!
en: sarimin!

source: RILEKS..
en: don’t worry,

source: NGGAK ADA YANG BERES KALAU TIDAK AKU PANTAU, MAH...
en: if I leave it to them, my work will be a mess.

source: *ASAL NUDUH*
en: *make a wild accusation*

source: Kalian semuanya..
en: all of you...

source: Kita sudah jauh-jauh ke sini dari kota s..
en: we’ve traveled a long way to get here.

source: Permisii..!
en: excuse me!

source: NJUS..!!
en: come

source: Atau kau ingin mencari tempat lain?
en: or are you thinking of moving somewhere else?

source: RISIKO..
en: like this.

source: UNFAEDAH, GIMANA
en: why don’t you

source: SEBELAH SANA!!!
en: over there!

source: BUKAN URUSAN-
en: you,

source: KELUARGA..
en: for his family too.

source: TAKKAN KUBIARKAN
en: but I can’t

source: CEPATLAH BANGUN,
en: hurry and wake up,

source: MAU KETEMU
en: I don’t care

source: NGGAK BISA
en: still can’t

source: PIPIKU..
en: my cheek.

source: MEMINJAM KEKUATAN JIN
en: bulus jimbung’s

source: Datanya sudah ku back-up di cloud service dunia manusia..
en: I’ve already made a backup of the data using a cloud service in the human world..

source: KENAPA AKU TIBA-
en: how did I

source: KOSONG DAN SEPI INI..
en: and quiet field...

source: KENAPA POHON STROBERI..?
en: why strawberry fields?

source: Tapi kenapa?!
en: but why?!

source: Pekerjaan ini menyenangkan juga, ya..
en: this job is becoming more and more interesting.

source: SEPERTINYA TAMU
en: from the looks of it,

source: PLAK!!
en: slap

source: KAU SUDAH KE-
en: to be

source: JATUH
en: fall down.

source: AKU MENGAJAKMU
en: I wanted

source: AKU TERBANG!!
en: I’m floating!

source: Saatnya minum obat!!
en: time for your medication!

source: TIDAK TAKUT
en: me,

source: CUMA 5 MENIT JALAN KAKI..?
en: shouldn’t take longer than 5 minutes.

source: AHAHAHAHA..
en: hahahaha

source: SWOOSHH
en: swoosh

source: SEBENARNYA LELAKI
en: was

source: SENDIRI BAGAIMANA?
en: about your family this way?

source: KARMA ITU
en: karma

source: Kau sadar kan, Tirta itu berusaha memonopoli sektor pesugihan?
en: you realize that tirta tried to monopolize the black magic market, don’t you?

source: TEMPO HARI!!
en: my lesson!

source: AKU SUDAH
en: I’ve warned you

source: KERJA KERASKU!
en: of my hard work!

source: NGENDUS-ENDUS
en: he sniffing

source: LAH!!
en: it!

source: MAKHLUK GHOIB
en: the spirit

source: Senam..
en: an aerobics

source: KANAN..
en: look right,

source: BINTANG LIMA..
en: to a five-star hotel...

source: SENSOR WEBTUN
en: PG 13.

source: DADAH,
en: goodbye,

source: KE TEMPAT INI..
en: how we ended up here.

source: PADAHAL KITA PERGI CAMPING BEGINI SEKALIAN MAU MERAYAKAN ULANG TAHUNKU BESOK..
en: my birthday is tomorrow, and this trip is supposed to be a celebration of that.

source: KETAKUTAN JIKA
en: if they were

source: E-EEH?!?!
en: h-huh?!

source: Saya akan tindak serius kalian!!!!
en: I won’t let this slide, you hear?!

source: NYA JADI NGGAK
en: look

source: HENTIKAN..!!
en: stop!

source: ..JURUS
en: one thousand

source: KANMU BEGITU SAJA!!
en: last night!

source: KAN AHLINYA
en: he’s the expert.

source: ..NGG?
en: huh?

source: DITINGGALKAN
en: about this?

source: *PARNO*
en: scared

source: TAPI, JUJUR SAJA..
en: but to be honest,

source: KE PIHAK LAIN..
en: on him...

source: Pastikan juga keluarga itu merasa nyaman, jangann sampai mereka kabur dari sini sebelum kita mencapai tujuan kita..
en: please make sure that everyone in the family feels at home here. don’t let them leave before we finish what we need to do.

source: ..POHON
en: this tree

source: GANGGU!!
en: humans!

source: Jadi jalannya ditutup sementara
en: so we’ve decided to close the road.

source: AKU TAKUT SEKALI..
en: I’m so worried about her.

source: NI YAAA SEBELUM-
en: for

source: TRUK ITU..
en: to hurt him.

source: JALAN LAGI!!
en: lately!!!

source: T-TUNGGU!!
en: w-wait!

source: TIDAK MUNGKIN
en: he’s

source: KANTOR SAJA,
en: use the company’s car.

source: 'DIA' BENAR..
en: “he” was right.

source: OPO KUWI!?
en: what the hell?

source: Tanpa jasaku, kau hanyalah roh macan yang tersesat dan lemah..
en: if it hadn’t been for me, you would’ve been nothing but a helpless and feeble tiger spirit.

source: DENGAR ADA CERITA-
en: I don’t wanna hear any of you

source: GYAAA
en: gaaah

source: SEKARANG AKU SUDAH
en: who would’ve thought

source: INI PASTI ULAH
en: this was

source: Sushi lagi??
en: again?

source: TIDAK PUNYA KEMAM-
en: that kind of

source: APALAGI INI KOTA WISATA
en: not to mention this city is quite popular.

source: PLOK!
en: pat

source: Kami membutuhkan petunjukmu..
en: ...and we rely upon you.

source: BERTAHANLAH!!
en: mr. purnomo!

source: JELEK BANGET
en: when she’s angry!

source: MELIHAT REAKSIMU..
en: judging by your reaction,

source: KALAU MEREKA
en: if they don’t want

source: Ohhhh?
en: ohhh???

source: Bahkan dia kuminta untuk pergi dari sini untuk selama-lamanya
en: and I even told him to leave for good.

source: Makananku dijatah?!?
en: they set a limit on how much I eat?

source: LIHATKU..
en: me...

source: Sepertinya tidak mungkin mereka menyusul tanpa kenadaraan..
en: they can’t catch up to us without vehicles.

source: INI
en: this isn’t

source: Sudah cukup jauh..
en: we’ve gone far enough.

source: DI SINI?
en: that resides here?

source: TAPI LIHATLAH
en: but

source: SETIDAKNYA KAMI DIKABARI, KEK!!
en: which is unacceptable!

source: JIKA PAK J MAU
en: if you want to

source: KOK TIBA-TIBA
en: does it

source: SITU
en: the nearest tree.

source: Tunggu!!
en: wait!

source: BOLEH MEM-
en: waste

source: PAK PURNOMO!!
en: stay with me,

source: ADA TELPON DARI KANTOR!
en: someone from the office is calling.

source: INI..!!!!!
en: you know?!

source: AKU AKAN BER-GABUNG DENGAN WARGA LAIN UNTUK MENCARI PUTRI KITA..
en: I’ll go find our daughter with the locals.

source: Xixi
en: haha!

source: HIHI, MOHON MAAF PARA PENUMPANG..
en: haha. sorry, my passengers.

source: YA?
en: at any moment.

source: KEHILANGAN LEBIH
en: I wouldn’t let this continue

source: MASIH MENCOBA
en: continue to spout

source: AH, LIHAT!!
en: look!

source: HIIIYY!!
en: Eeeeekkk!!!

source: YUK GERAKIN BADAN-NYA!
en: and get our bodies moving!

source: JANGAN-
en: is it

source: LAGI!!!
en: again!

source: SESEMBAHANMU
en: you place the offering

source: SUDAH KUDUGA!
en: I knew it!

source: Udah lebih dari 3 menit, bangsat..
en: you said it would only take 3 minutes, doofus...

source: MAS…!!
en: you!

source: INI LOKASI FOTO YANG SERING NONGOL DI AKUN INSTAGRAM TANTE SHELLY, MAH?
en: isn’t this the place that shelly often posts about on nistagram?

source: ..NAMPAKNYA
en: you seem

source: ANEH..!!
en: any sense!

source: BISA BERGERAK!!
en: my legs.

source: LAGIPULA,
en: besides,

source: AMBIL DARI DAERAH
en: from

source: *MATI TOTAL*
en: *completely broken*

source: H..HEI..
en: b-but...

source: BELUM
en: believe it

source: PADAHAL AWALNYA
en: he said

source: CADANGAN DARI PARA
en: that you got

source: POKOKNYA KITA HARUS SEGERA PERGI DARI SINI!!!
en: we need to get out of here now!!!

source: KOK MUKA-
en: you don’t

source: DIA ITU PUTRINYA
en: she’s mr. sunaryo’s

source: EMANG ADA SESUATU
en: there’s something

source: HOOO..
en: aww, shoot...

source: AHHH..
en: ahh...

source: ..KENAPA POLA PIKIR
en: you shouldn’t

source: SAAT AKU DATANG..
en: into this place.

source: KLIENMU YANG MAKIN
en: from your ever-decreasing

source: DOK!
en: badump

source: HUHU..
en: sob sob...

source: ENERGI TIRTA YANG
en: tirta’s energy

source: BELUM TIDUR SAMA-
en: in two days.

source: ..MALAM INI,
en: that night,

source: SW
en: swoosh

source: MEONG...
en: meow...

source: MELAKUKAN SEMUA
en: would do

source: UNTUK MEMBALAS
en: here to return

source: PIKIR, KITA NIKAH-
en: we really got married

source: ..ADA SESUATU
en: there’s

source: ..SUDAH
en: do

source: GERAK SAMA-
en: moving

source: SAYA HANYA
en: I just

source: JA..
en: th-

source: HMMM..
en: hmm...

source: Silahkan, tuan!
en: enjoy your meal, sir!

source: Bertahun-tahun menunggui gunung ini, kau masih suka pakai cara klasik, ya..
en: you’ve been residing on this mountain for years, and you still prefer the old-fashioned method?

source: AKU INGIN
en: I wanted

source: JAWABLAH!!
en: please respond!

source: Padahal kenyataannya aku ini yang paling banyak berinovasi..
en: in fact, I’m the most creative jinn you’ll ever find.

source: SENDIRIAN AKU
en: be able

source: DIMANA?!
en: am I?!

source: SIAPA INI?!
en: who’s this guy?!

source: BERDUKA UNTUK
en: for what happened

source: DARI SINI..
en: around here somewhere...

source: Tenang, pak..
en: calm down, sir...

source: SAYA NEBENG, YA..
en: can I come along?

source: AKU TIDAK BISA MENGELUARKAN PIKIRAN BURUK INI DARI KEPALAKU..?!
en: why can’t I stop thinking negatively?

source: MANUSIA TIPE
en: for a person

source: DAFTAR PENCARIAN ORANG
en: WANTED

source: KOTOR?!
en: greasy?!

source: KALAU KUJUAL CEPAT
en: I guess if you sell

source: TERASA TERANG
en: feels so warm

source: UNTUNG
en: we have

source: TAHU SEBAB ASLINYA..
en: the cause of his death.

source: SIAPA AKU
en: who I am

source: RAME BANGET!
en: it’s going to be fun!

source: Tu..
en: mr...

source: KHH--
en: ugh...

source: Bukannya sudah keceritakan di episode pertama season 2 ini?
en: haven’t I told you about it in the first episode of season 2?

source: TIDAK AKAN LUPUT DARI
en: and his own family

source: MAKASIH
en: thank you

source: BEBERAPA HARI SEBELUMNYA
en: a few days ago.

source: MEREKA YANG
en: since the victims

source: AYAH!!
en: honey?!

source: KIN…
en: it can’t be.

source: BERTEMU DENGAN
en: to see you

source: TERNYATA
en: I can’t believe

source: MENDING AKU BAWA
en: all of the money

source: BICARAAN KITA!!
en: us, sarimin!

source: Anda..
en: you’ve...

source: DARIPADA KITA
en: instead of

source: IKUT CELAKA,
en: getting ourselves killed,

source: APAKAH KAU INI
en: are you

source: Mau nyalain lagi kembang apinya?
en: should we light more?

source: RASANYA JANGGAL
en: it was really

source: DASAR ANAK MUDA
en: you

source: DEK RATNA..!!
en: your father!

source: JADI?!?!
en: going on?!

source: ADA APA NIH,
en: what’s going

source: Ketangkasannya membuatku jatuh cinta pada pandangan pertama!!
en: and I married her for it!

source: MUNCUL..
en: sarimin...

source: SECEPAT MUNGKIN?
en: as soon as possible?

source: MELAWANKU,
en: with me,

source: JADI PADA BONEKA
en: with that

source: HAH?!
en: what?!

source: DIRIKU…
en: regrets...

source: ..ANAKKU
en: my son

source: JIN PENUNGGU, YA?
en: a jinn, huh?

source: DI KEBON?!
en: sleeping?!

source: ..BEGINIAN ADA
en: you have

source: BERADA DI LUAR
en: or

source: ..TUMBAL!!
en: a sacrifice!

source: TOLONG JAGA ANJAS..
en: please take care of anjas.

source: Sebenarnya kamu masih bisa mengklaim apa yang sebenarnya milikmu, kan?
en: oh, while we’re at it, don’t you think it's time for you to claim what’s yours?

source: APAAN, NIH?!
en: what is this?!

source: B-O-D-O-A-M-A-T!!!
en: w-h-o-c-a-r-e-s?!

source: SUDAH KUMATIKAN,
en: the stove off,

source: LHO..
en: for real.

source: AKU TIDAK BISA MENGONTROL PER-KATAANKU TADI..
en: I went too far and lost control...

source: GRO
en: roar

source: MANUSIA TIDAK AKAN BISA
en: never be on the same

source: YA AMPUN AYAH CEROBOH BANGET, SIH..
en: oh, honey, how could you be so careless?

source: PISANG SATU TANDAN,
en: what he desires,

source: KALIAN MENEBANG
en: let you

source: GEGAS!!
en: make haste!

source: BWUH!!
en: blow

source: LAGI, APA YANG
en: what are you

source: Kutemukan di dekat camp ground nomor 3, tempat yang sangat terbuka!
en: I found her in an open area near campground 3!

source: YANG ASLI KEMARIN PATAH KARENA AKU DUDUKIN DI KANTOR...
en: the main ones broke because I accidentally sat on them at work.

source: DUH, BERAT,
en: ugh, I can’t

source: WAKTUNYA
en: the deadline

source: Tempat ini memang tidak beres..
en: there is something wrong with this place.

source: DIA SEDANG DALAM
en: saying he’s on

source: Semoga pelayan ini tidak salah paham dengan kebaikanku tadi..
en: I hope this maid didn’t misinterpret my kindness.

source: TIDAK, DIVA?
en: diva?

source: Sebentar lagi akan ada yang naik gunung...
en: someone is going up the mountain.

source: ZHAA
en: swoosh

source: MAIN TERUS, NGGAK
en: is play around.

source: SEKALI..
en: my eyes

source: DI SUATU HARI YANG CERAH...
en: on a bright sunny day...

source: Sebentar aku ganti baju dulu, yak!
en: give me a minute to get changed.

source: HARUS FOKUS BEKERJA
en: on the task at hand

source: K-KEMBALIKAN..
en: back

source: INI MASIH KEBON
en: isn’t this

source: JALAN NINJAKU!
en: can’t help it.

source: HAMPIR LUPA,
en: I almost forgot.

source: TIDAK KUNJUNG
en: no sign of

source: Saat itu panelnya nggak cukup
en: we couldn’t add more panels, remember?

source: Melakukan apapun yang anda perintahkan..
en: to carry out all of your instructions.

source: LALU..
en: now there’s

source: ACK--!
en: eek!

source: TENTU SAJA..
en: to track you,

source: KIIIKK....!!!!!
en: eekkk!!!

source: ATAS NAMANYA
en: wasn’t signed

source: Pantesan nggak jawab-jawab...
en: no wonder he didn’t respond to me...

source: BISA MASUK JUGA..
en: finally, we’re in.

source: BLARR!
en: boom

source: KOK BISA TAHU?
en: how did you know?

source: MANUSIA..?
en: silhouette?

source: ..DAN DI SANA
en: there,

source: SETELAH MENGINTIP
en: after I caught

source: MAU MENGINAP DI
en: you’d spend the night

source: SAHAN
en: my respect.

source: JANGAN KHAWATIR!!
en: don’t worry!

source: YA SAYA KAN
en: well,

source: BOSS-KU, JADI
en: ex-boss.

source: LAMA, LHO!!
en: to wasa’s house!

source: SINI COBA KULIHAT--
en: let me see--

source: AYAH..?
en: dad?

source: SAYA HANYA INGIN MEMASTIKAN, APAPUN YANG TERJADI, PAK, BU, MOHON UNTUK--
en: I just want to say that no matter what happens, I hope you will--

source: Atau kemungkinan terburuk, tirta lah yang akan mengklaim wilayah tersebut
en: or, in the worst case, tirta would be the one to claim the land,

source: KAU?!
en: are you?!

source: SALAM PERPI-
en: and pay

source: Kau masih punya klien yang kontraknya masih berjalan, kan?
en: you still have clients with active contracts, right?

source: MABOK??
en: is he drunk?!

source: PERTAMA KALI
en: I haven’t

source: BUANG AIR
en: a leak.

source: TIDAK MUNGKIN!!
en: how’s this possible?!

source: DENGAN GERGAJI
en: and use

source: BENAR,
en: you’re right,

source: SEPERTINYA WUJUD TER-
en: I guess my appearance

source: MANUSIA ITU
en: humans

source: SANGAT TIDAK
en: insensitive,

source: O SH*T-
en: oh, crap...

source: MAS UDAH
en: I’m

source: Bacot, langsung saja ke intinya
en: drop it, get to the point.

source: Wah, penganten baru, nich..
en: a newlywed couple, huh?

source: Semoga dia tidak kembali lagi ke sini
en: I hope he’ll never come back.

source: PACARAN TUH JANGAN
en: if you want to screw around,

source: (Malam Jumat Kliwon ONLY)
en: (ONLY on Friday the 13th)

source: Akan kami siapkan kamar tambahan
en: I’ll get a room ready for you.

source: AGAR TEMPAT INI SELALU RAMAI DIKUNJUNGI..
en: for the sake of keeping this place full of tourists and villagers,

source: SARIMINNIE..!!!
en: sarimin!!!

source: PENUNGGU?
en: jinn?

source: ..SAYANG JUGA, PADAHAL PROSPEK BISNISNYA CUKUP BAUS..
en: such a shame, the business prospects look promising though.

source: -SELESAI-
en: -the end-

source: AGAR AKU BISA MELIHAT WAJAH-MU LEBIH JELAS..
en: so I can better see your face.

source: DARI SEKOLAH BUAT
en: for the whole

source: Aku kan sudah mati, tapi kenapa aku bisa dibuat deg deg-an gini?
en: I’m already dead, but why does he make my heart flutter?

source: MILIKNYA..
en: tree.

source: WTF?!
en: eww!

source: HUWAA HANDPHONE BARUKU!!!
en: sob sob... my new phone!!!

source: SAAT SEPERTI INI!!
en: at this time!

source: BOSSNYA..
en: who’s the boss around here!

source: LOKASI PROYEK..
en: at the hospital...

source: LELAH?!
en: tired.

source: Kau terlihat cukup yakin untuk ide yang tergolong aneh semacam ini..
en: you seem to have a strong belief in this weird concept.

source: BURUK!!
en: a nightmare!

source: NGETAWAIN MAS,
en: so funny,

source: DIA PUNYA BISNIS
en: a business owner.

source: EITSS..!!
en: oops!

source: MANUSIA…
en: mortals.

source: BATS!!
en: release

source: MULAI MEREGANG
en: without

source: Ini aku, Suro..
en: it’s me, suro.

source: SEREM..
en: I’m scared...

source: NANTI MOBILNYA KENAPA-KENAPA GIMANA?!?!
en: you’re breaking the car!

source: HALO, PEMIRSA!
en: hello, viewers!

source: CERITA YANG TIDAK-
en: spouting nonsense,

source: LIKAN UANGKU INI
en: my money

source: MAS TRESNOOOO,
en: tresno!

source: Aku mulai, yak
en: shall we begin?

source: ..DI DUNIA INI
en: nothing

source: SUDAHLAH, YAH!
en: calm down, honey!

source: *LIRIK*
en: *glance*

source: TERSISA DALAM
en: so many

source: G-GWAHH!!
en: gaah!!!

source: Gimana.
en: so...

source: DI SINI….
en: this apartment.

source: TIDAK...
en: this

source: Kenapa kau membawa anak itu kembali ke sini!?
en: why did you bring that kid back?

source: PERDUKUNAN
en: 20 years.

source: CEPAT GANTI
en: then hurry

source: ENGH…!!
en: ugh!

source: Kalau orang itu berbohong, mungkin aku bisa melawannya untuk mengambil alih mobilnya
en: if that guy is trying to trick us, we can at least fight him and take over the car.

source: TAPI, PERASAAN
en: but what’s this

source: DIA BILANG MAU BALIK KE TENDA, KAN?
en: but she said she was going there, right?

source: GYAAAA!!
en: gaaah!

source: JANGAN-JANGAN
en: have you

source: DU
en: thud

source: DENGAN HAL-HAL MISTIS
en: intertwines with

source: MENJADI KORBAN
en: were my

source: GAGAL DEH..
en: it!

source: PIKIRKAN PERASAAN KAMI YANG MISKIN JUGA, DONG!!!
en: think of those of us who can’t afford fancy stuff!

source: ..KALAU TIDAK SALAH DI SITU MEMANG DIBANGUN HOTEL, SUDAH HAMPIR SELESAI PULA..
en: if I’m not mistaken, they were building a hotel, and it was almost done.

source: PAK?
en: to me?

source: *REFLEK NGELEMPAR*
en: *she throws it spontaneously*

source: Dimana ini?
en: where am I?

source: JANGAN LIBATKAN
en: keep me

source: CARI TAHU SENDIRI
en: some info

source: Nyawa kita..
en: our lives.

source: NGGAK!!
en: no!

source: DAN TRESNO SUDAH
en: and I was

source: BISA DIKIRIM KILAT!
en: he can deliver them right away!

source: YANG DIRAWAT DI RS
en: who were

source: OH, OKE,
en: oh, sure.

source: YANG LUCU?!
en: this is funny?!

source: G-GWAHH!!!
en: gaaah!!!

source: BODO AMAT!!
en: so?!

source: AYOLAH,
en: oh, sarimin,

source: KALAU BEGITU..
en: well...

source: ..MENYEDIHKAN
en: what a sad

source: DARI KALIAN BERANI
en: had the guts

source: MAKANYA MAS BILANG
en: I told you

source: KAKIKUUUU!!!
en: my leg!!!

source: MAU DIAPAIN LAGI, MAH?
en: what are you gonna do with them?

source: KYAA--!!
en: kyaaa!

source: MAAF, DIVA..
en: I’m sorry, diva...

source: BERADA DI POSISINYA,
en: in his shoes,

source: EHHH??!
en: huh?

source: DIA!!!
en: huh?!

source: DI DALAMNYA
en: so many memories.

source: S… SIAPA!?
en: wh-who?

source: Pasti ada jalan keluar, kan!?
en: there must be a way out!

source: INI TIDAK MAIN-
en: not messing

source: HEH…
en: hehe...

source: SEPENUHNYA SALAHMU,
en: in the wrong,

source: NYA DARI SALAH SATU
en: one of

source: ATAU DUIT MONOPOLI,
en: or fake bills?

source: UT!
en: (redacted)

source: Ayah..
en: dad...

source: EHH?
en: eh?

source: JANGAN KHAWATIR, PUTRI ANDA PASTI TIDAK AKAN JAUH-JAUH..
en: don’t worry, your daughter must’ve not gotten far.

source: HAL-HAL JANGGAL
en: peculiar things

source: KAKAK MAU KEMANA!?
en: where are you going?!

source: OH, GITU…
en: I see...

source: SIAP, MAS..
en: well,

source: HEHE, KIRAIN..
en: haha...

source: KAMU ADA
en: where the heck

source: Sudah habis?
en: it’s done already?

source: Lagipula boss Sima kan sebenarnya nggak suka pisang..
en: besides, boss sima doesn’t eat bananas.

source: DIAMLAH!!
en: pipe down

source: KEGELAPAN
en: the darkness

source: ..MBAK..
en: hello...

source: KEKUATAN
en: what’s

source: KAPAN DIPESAN-
en: when did

source: SEBENTAR LAGI KITA SAMPAI DI CAMPING GROUND!
en: we’ll be at the campground soon!

source: MAU PULANG, TAPI
en: about to go home,

source: HUSH, HUSH!!
en: shoo, shoo!!!

source: SWOO
en: swoosh

source: Ack!!
en: yikes!

source: PROGRESS KALIAN,
en: your progress,

source: APA YANG TERJADI
en: look

source: HAL MISTIS, LEBIH BAIK
en: this nonsense, perhaps

source: TOLONG
en: please

source: DARI MAMAH..
en: me...

source: PENUNGGU DI SINI
en: the other shaman had

source: ..YANG KERAP MENJADI PILIHAN DESTINASI WISATA KELUARGA..
en: this village has been made into a popular vacation spot.

source: Mamah..
en: mom...

source: GWAAHHHH!!!!
en: ewwwww!!!

source: DARIPADA KAMU
en: to attend to.

source: (AKU JUGA SEMPAT DI-JUAL KE SANA KEMARI, TAPI AKU BERHASIL KABUR DAN AKHIRNYA SAMPAI KE PEGUNUNGAN INI!
en: (they even tried to sell me, but I was able to get away and ended up in this mountain.)

source: AKU..!!
en: me!

source: Suara apa itu!?!?
en: what was that?!

source: Apa-apaan ini!?
en: what are you doing?!

source: SAJA AKU, OKEH?
en: a call, okay?

source: ..APAKAH
en: are

source: PPPFFFTT--!!
en: Pfffttt-!

source: SEKARANG SEMUANYA HILANG!!
en: everything’s gone now!!!

source: Kalian sudah salah memilih lawan!!
en: she’s out of your league!

source: LIBURAN KALI INI PUN, SEBENARNYA SUDAH KAMU RENCANA-KAN JAUH-JAUH HARI, SEKALIGUS MERAYAKAN ULANG TAHUN NATASYA BESOK..
en: we’ve planned this trip for a while... initially, we planned to celebrate natasya’s birthday tomorrow.

source: KALAU DIPIKIR-
en: looking back,

source: TULANG PUNGGUNG
en: and had to be the breadwinner

source: Dia itu yang seharusnya jadi persembahan tuan Sima!!
en: this kid was meant to be an offering for master sima!

source: YA, PAK?
en: close the deal, sir.

source: MAU NGUNDANG
en: wasa didn’t respond

source: DAN KHUSUS BARESKRIM POLRI
en: the police

source: INIKAH..
en: is this...

source: Baru kemarin kami berangkat ke tempat ini, tapi sudah banyak hal yang terjadi..
en: we arrived here just yesterday, but a lot has happened since then.

source: CUMA NYELIP,
en: there it is,

source: APA MAKSUD-
en: what are you

source: Bukannya ini satu satunya akses ke wisata lereng gunung simatung, pak?
en: isn’t this the only way to get down to the foot of mount simatung?

source: PADA PRIA ITU, YA?
en: in that guy, huh?

source: UANG?!
en: our money?!

source: SEPERTIMU!!
en: see one!

source: *HENING*
en: *silence*

source: MBAH TIRTA
en: tirta said

source: KYA!!
en: hey!!!

source: APAPUN BISA TERJADI..
en: anything could happen to her.

source: ADA KABAR BURUNG..
en: I’ve got

source: Hei, kalian berdua!!
en: hey, you two!

source: TAMPARAN SERIBU
en: softshell turtle

source: DATANG KE PE-
en: come to

source: LAKUKAN DI KEBON
en: doing there

source: ULAR JEJADIAN!!
en: it really is a familiar!

source: 'HUMAN ERROR'
en: “human errors”

source: Mau ngerasain dedek bayi di perut?
en: do you want to feel the baby too?

source: SIAL, AKU APES
en: just

source: ADA..
en: real.

source: PASANG PELET ATAU
en: retribution or a curse

source: MERASA BER-
en: instead

source: PERJALANAN MENUJU
en: his way

source: DARAHAN DI
en: the bleeding

source: SETIAP TEMPAT MEMILIKI KISAH YANG SENGAJA TIDAK DICERITAKAN
en: every place has its own untold tales...

source: SEBENARNYA AKU NGGAK
en: I’m not one

source: HUFFT!!!!
en: hmph!!!

source: Permisii..
en: excuse me...

source: BISA NGOBROL
en: we want to speak with you
